"use strict";
exports.LANG_EN_NAME = 'en';
exports.LANG_EN_TRANS = {
    'CE': 'م',
    'AH': 'هـ',
    'G_LONG_MONTHS': [
        "يناير",
        "فبراير",
        "مارس",
        "إبريل",
        "مايو",
        "يونيو",
        "يوليو",
        "أغسطس",
        "سبتمبر",
        "أكتوبر",
        "نوفمبر",
        "ديسمبر"
    ],
    'G_SHORT_MONTHS': [],
    'H_LONG_MONTHS': [
        "المحرم",
        "صفر",
        "ربيع الأول",
        "ربيع الثاني",
        "جمادى الأول",
        "جمادى الثاني",
        "رجب",
        "شعبان",
        "رمضان",
        "شوال",
        "ذو القعدة",
        "ذو الحجة"
    ],
    'H_SHORT_MONTHS': [],
    'LONG_DAYS': [
        'الأحد',
        'الاثنين',
        'الثلاثاء',
        'الأربعاء',
        'الخميس',
        'الجمعة',
        'السبت'
    ],
    'SHORT_DAYS': [
        'الأحد',
        'الاثنين',
        'الثلاثاء',
        'الأربعاء',
        'الخميس',
        'الجمعة',
        'السبت'
    ]
};
